AccumulationRegisters/Продажи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>Продажи</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

CommonModules/ОДоПБ_ОбщийМодуль/Ext/Module.bsl
Процедура ВыполнитьОтправкуДанных(Дата1 = Неопределено, Дата2 = Неопределено) Экспорт

	Если Дата1 = Неопределено Тогда
		Дата1 = ТекущаяДатаСеанса() - Константы.ОДоПБ_ГлубинаОтчета.Получить() * 24 * 60 * 60;	// N дней назад
	КонецЕсли;
	
	Если Дата2 = Неопределено Тогда
		Дата2 = ТекущаяДатаСеанса();
	КонецЕсли;
	
	// Запрос нужных данных из базы
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ПродажиОбороты.Клиент КАК Клиент,
		|	ВЫРАЗИТЬ(ПродажиОбороты.Период КАК ДАТА) КАК ДатаЗаказа,
		|	СУММА(ПродажиОбороты.СуммаОборот) КАК Сумма
		|ИЗ
		|	РегистрНакопления.Продажи.Обороты(&Дата1, &Дата2, День,) КАК ПродажиОбороты
		|СГРУППИРОВАТЬ ПО
		|	ПродажиОбороты.Клиент,
		|	ВЫРАЗИТЬ(ПродажиОбороты.Период КАК ДАТА)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДатаЗаказа";
	
	Запрос.УстановитьПараметр("Дата1", НачалоДня(Дата1));
	Запрос.УстановитьПараметр("Дата2", КонецДня(Дата2));
	РезультатЗапроса = Запрос.Выполнить();
	
	// Получение и формирование данных для выгрузки в JSON
	МассивИтоги = Новый Массив;	// Массив для сборки итогов
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		СтруктураЗаказ = Новый Структура();	// Структура текущая записи
		СтруктураЗаказ.Вставить("Дата", Выборка.ДатаЗаказа);
		СтруктураЗаказ.Вставить("Покупатель", Строка(Выборка.Клиент.Наименование));
		СтруктураЗаказ.Вставить("Сумма", Выборка.Сумма);
		
		МассивИтоги.Добавить(СтруктураЗаказ);

	КонецЦикла;
	
	// Формирование и запись пакета JSON 
	ПараметрыJSON = Новый ПараметрыЗаписиJSON(, Символы.Таб);
	ЗаписьJSON = Новый ЗаписьJSON;	
	ЗаписьJSON.УстановитьСтроку(ПараметрыJSON);
	
	НСJ = Новый НастройкиСериализацииJSON;
	ЗаписатьJSON(ЗаписьJSON, МассивИтоги, НСJ);
	СтрокаJSON = ЗаписьJSON.Закрыть();
	
	//Соединение = Новый HTTPСоединение("localhost/OTUS_VKR/hs/ClientReportRecive");	// Для теста
	Соединение = Новый HTTPСоединение(Константы.ОДоПБ_ПутьКХосту.Получить());
	Запрос = Новый HTTPЗапрос("/report");
	Запрос.Заголовки.Вставить("Content-Type", "application/json; charset=utf-8");
	Запрос.УстановитьТелоИзСтроки(СтрокаJSON, КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать);
	Ответ = Соединение.ОтправитьДляОбработки(Запрос);
	
	Если Ответ.КодСостояния = 200 Тогда
		
		Сообщить("Данные успешно отправлены на сервер!");
		// Запись успешной отправки в ЖР
		ЗаписьЖурналаРегистрации("Отправка данных о продаже билетов",
			УровеньЖурналаРегистрации.Информация, , , "Данные успешно отправлены на сервер " + Константы.ОДоПБ_ПутьКХосту.Получить());
		
	Иначе
		
		Сообщить("Получена ошибка от сервера с кодом " + Ответ.КодСостояния);
		// Запись ошибки сервера в ЖР
		ЗаписьЖурналаРегистрации("Отправка данных о продаже билетов",
			УровеньЖурналаРегистрации.Ошибка, , , "Получена ошибка от сервера " + Константы.ОДоПБ_ПутьКХосту.Получить() + " с кодом " + Ответ.КодСостояния);
		
	КонецЕсли;

КонецПроцедуры
